#### Lisa Over
CMPINF 2110<br>
Homework 4: Bob Ross<br>
March 10, 2021

In [52]:
import sys
print(sys.executable)

/Users/lisa/opt/anaconda3/envs/cmpinf_2110/bin/python

In [53]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

import seaborn as sns

#### Read in data: tidy data and separate titles data

In [54]:
data_file = 'ross_episodes_tidy.csv'
df_tidy = pd.read_csv( data_file )

In [55]:
df_tidy.head()

   season  episode    feature    artist artist_name artist_relationship
0       1        1     BUSHES  BOB_ROSS    Bob Ross             Himself
1       1        1  DECIDUOUS  BOB_ROSS    Bob Ross             Himself
2       1        1      GRASS  BOB_ROSS    Bob Ross             Himself
3       1        1      RIVER  BOB_ROSS    Bob Ross             Himself
4       1        1       TREE  BOB_ROSS    Bob Ross             Himself

In [56]:
data_file = 'ross_titles.csv'
df_titles = pd.read_csv( data_file )
df_titles.head()

   season  episode                  TITLE
0       1        1  "A WALK IN THE WOODS"
1       1        2         "MT. MCKINLEY"
2       1        3         "EBONY SUNSET"
3       1        4          "WINTER MIST"
4       1        5         "QUIET STREAM"

#### Clean up df_titles

In [57]:
df_titles.rename(columns={'TITLE':'title'}, inplace=True)

In [58]:
df_titles['title'] = df_titles['title'].str.replace(r"[\"\',]", '')

<ipython-input-58-b2f71bd5ff22>:1: FutureWarning: The default value of regex will change from True to False in a future version.
  df_titles['title'] = df_titles['title'].str.replace(r"[\"\',]", '')

In [67]:
df_titles.head()

   season  episode                title
0       1        1  A WALK IN THE WOODS
1       1        2         MT. MCKINLEY
2       1        3         EBONY SUNSET
3       1        4          WINTER MIST
4       1        5         QUIET STREAM

#### Create artists entity with artist_id, artist_name, and artist_relationship

In [74]:
artists_entity = df_tidy.groupby(['artist', 'artist_name', 'artist_relationship']).size().reset_index(name='num_rows')

In [75]:
artists_entity.drop(['num_rows'], axis=1, inplace=True)

In [76]:
artists_entity.drop(['artist'], axis=1, inplace=True)

In [77]:
artists_entity['artist_id'] = artists_entity.index + 1
artists_entity

   artist_name artist_relationship  artist_id
0     Bob Ross             Himself          1
1  Diane Andre              Friend          2
2        Other             Friends          3
3   Steve Ross                 Son          4

#### Create paintings entity table with title, season, episode, and artist_id

Merge artist_entity data with data containing artist_name; merge on artist_name

In [86]:
artist_per_episode = df_tidy.groupby(['season','episode','artist_name']).size().reset_index(name='num_rows')

In [87]:
artist_merge = pd.merge(artist_per_episode, 
                           artists_entity,
                           how="left",
                           on="artist_name")
artist_merge.head()

   season  episode artist_name  num_rows artist_relationship  artist_id
0       1        1    Bob Ross         6             Himself          1
1       1        2    Bob Ross         9             Himself          1
2       1        3    Bob Ross        10             Himself          1
3       1        4    Bob Ross         8             Himself          1
4       1        5    Bob Ross         5             Himself          1

Merge artist_ids with data containing titles; merge on season and episode.

In [95]:
titles_merge = pd.merge(df_titles, 
                           artist_merge,
                           how="left",
                           on=['season','episode'])
titles_merge.head()

,season,episode,title,artist_name,num_rows,artist_relationship,artist_id
0,1,1,A WALK IN THE WOODS,Bob Ross,6,Himself,1
1,1,2,MT. MCKINLEY,Bob Ross,9,Himself,1
2,1,3,EBONY SUNSET,Bob Ross,10,Himself,1
3,1,4,WINTER MIST,Bob Ross,8,Himself,1
4,1,5,QUIET STREAM,Bob Ross,5,Himself,1

In [96]:
paintings_entity = titles_artist_ids[['season','episode','title','artist_id']].copy()
paintings_entity.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 403 entries, 0 to 402
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   season     403 non-null    int64
 1   episode    403 non-null    int64
 2   title      403 non-null    object
 3   artist_id  403 non-null    int64
dtypes: int64(3), object(1)
memory usage: 15.7+ KB

#### Create features entity table with feature_name

In [97]:
features_entity = df_tidy.groupby(['feature']).size().reset_index(name='num_rows')

In [98]:
features_entity.drop(['num_rows'], axis=1, inplace=True)

In [99]:
features_entity['feature_id'] = features_entity.index + 1
features_entity

            feature  feature_id
0       APPLE_FRAME           1
1   AURORA_BOREALIS           2
2              BARN           3
3             BEACH           4
4              BOAT           5
..              ...         ...
58            WAVES          59
59         WINDMILL          60
60     WINDOW_FRAME          61
61           WINTER          62
62      WOOD_FRAMED          63

[63 rows x 2 columns]

#### Create painting to features link table

In [102]:
features_per_episode = df_tidy[['season','episode','feature']].copy()
features_per_episode.head()

   season  episode    feature
0       1        1     BUSHES
1       1        1  DECIDUOUS
2       1        1      GRASS
3       1        1      RIVER
4       1        1       TREE

In [105]:
missing_feature = features_per_episode.loc[features_per_episode['feature'].isna(), :]
missing_feature.head()

      season  episode feature
824        9       10     NaN
1439      15        4     NaN
2546      26       10     NaN

In [106]:
df_tidy.loc[(df_tidy['season'] == 9) & (df_tidy['episode'] == 10)]

     season  episode feature    artist artist_name artist_relationship
824       9       10     NaN  BOB_ROSS    Bob Ross             Himself

In [107]:
paintings_entity.loc[(paintings_entity['season'] == 9) & (paintings_entity['episode'] == 10)]

     season  episode          title  artist_id
113       9       10  COUNTRY CHARM          1

In [108]:
df_tidy.loc[(df_tidy['season'] == 15) & (df_tidy['episode'] == 4)]

      season  episode feature    artist artist_name artist_relationship
1439      15        4     NaN  BOB_ROSS    Bob Ross             Himself

In [109]:
paintings_entity.loc[(paintings_entity['season'] == 15) & (paintings_entity['episode'] == 4)]

     season  episode                 title  artist_id
185      15        4  PEACEFUL REFLECTIONS          1

In [110]:
df_tidy.loc[(df_tidy['season'] == 26) & (df_tidy['episode'] == 10)]

      season  episode feature    artist artist_name artist_relationship
2546      26       10     NaN  BOB_ROSS    Bob Ross             Himself

In [111]:
paintings_entity.loc[(paintings_entity['season'] == 26) & (paintings_entity['episode'] == 10)]

     season  episode                  title  artist_id
334      26       10  PURPLE MOUNTAIN RANGE          1

In [112]:
features_per_episode = features_per_episode[~features_per_episode['feature'].isnull()]
features_per_episode.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3187 entries, 0 to 3189
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   season   3187 non-null   int64
 1   episode  3187 non-null   int64
 2   feature  3187 non-null   object
dtypes: int64(2), object(1)
memory usage: 99.6+ KB

In [113]:
features_link = pd.merge(features_per_episode, 
                           features_entity,
                           how="left",
                           on=['feature'])
features_link.head()

   season  episode    feature  feature_id
0       1        1     BUSHES           8
1       1        1  DECIDUOUS          17
2       1        1      GRASS          27
3       1        1      RIVER          46
4       1        1       TREE          55

In [114]:
features_link.drop(['feature'], axis=1, inplace=True)

In [115]:
features_link.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3187 entries, 0 to 3186
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   season      3187 non-null   int64
 1   episode     3187 non-null   int64
 2   feature_id  3187 non-null   int64
dtypes: int64(3)
memory usage: 99.6 KB

#### Export tables to CSV

In [117]:
paintings_entity.to_csv('ross_paintings.csv', index=False, na_rep='NULL')

In [118]:
artists_entity.to_csv('ross_artists.csv', index=False, na_rep='NULL')

In [119]:
features_entity.to_csv('ross_features.csv', index=False, na_rep='NULL')

In [120]:
features_link.to_csv('ross_features_link.csv', index=False, na_rep='NULL')